
#### Terraform Apply 📖`success`

<details><summary>Show Apply</summary>

```
Acquiring state lock. This may take a few moments...
data.nsxt_policy_edge_cluster.ec: Reading...
data.nsxt_policy_edge_cluster.ec: Read complete after 0s [id=860f008f-1ff4-460c-841d-04f6ea498203]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # nsxt_policy_gateway_redistribution_config.t0_route will be created
  + resource "nsxt_policy_gateway_redistribution_config" "t0_route" {
      + bgp_enabled       = true
      + gateway_id        = (known after apply)
      + gateway_path      = (known after apply)
      + id                = (known after apply)
      + locale_service_id = (known after apply)
      + ospf_enabled      = false
    }

  # nsxt_policy_gateway_redistribution_config.test will be created
  + resource "nsxt_policy_gateway_redistribution_config" "test" {
      + bgp_enabled       = true
      + gateway_id        = (known after apply)
      + gateway_path      = (known after apply)
      + id                = (known after apply)
      + locale_service_id = (known after apply)
      + ospf_enabled      = true

      + rule {
          + bgp   = true
          + name  = "redistribute-bgp"
          + ospf  = false
          + types = [
              + "TIER1_SEGMENT",
            ]
        }
    }

  # nsxt_policy_tier0_gateway.tier0_gw will be created
  + resource "nsxt_policy_tier0_gateway" "tier0_gw" {
      + default_rule_logging     = false
      + description              = "Demo-39 T0 Router - test-t0-shr"
      + display_name             = "test-t0-shr"
      + edge_cluster_path        = "/infra/sites/default/enforcement-points/default/edge-clusters/860f008f-1ff4-460c-841d-04f6ea498203"
      + enable_firewall          = true
      + failover_mode            = "NON_PREEMPTIVE"
      + force_whitelisting       = false
      + ha_mode                  = "ACTIVE_STANDBY"
      + id                       = (known after apply)
      + internal_transit_subnets = [
          + "169.254.0.0/24",
        ]
      + ipv6_dad_profile_path    = "/infra/ipv6-dad-profiles/default"
      + ipv6_ndra_profile_path   = "/infra/ipv6-ndra-profiles/default"
      + nsx_id                   = (known after apply)
      + path                     = (known after apply)
      + redistribution_set       = (known after apply)
      + revision                 = (known after apply)
      + transit_subnets          = [
          + "100.64.0.0/16",
        ]

      + bgp_config {
          + ecmp                               = true
          + enabled                            = true
          + graceful_restart_mode              = "HELPER_ONLY"
          + graceful_restart_stale_route_timer = 600
          + graceful_restart_timer             = 180
          + inter_sr_ibgp                      = false
          + local_as_num                       = "65000"
          + multipath_relax                    = true
          + path                               = (known after apply)
          + revision                           = (known after apply)
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
nsxt_policy_tier0_gateway.tier0_gw: Creating...
nsxt_policy_tier0_gateway.tier0_gw: Creation complete after 1s [id=e2077675-a8f7-4106-bf0f-6b5e3cb3a08a]
nsxt_policy_gateway_redistribution_config.t0_route: Creating...
nsxt_policy_gateway_redistribution_config.test: Creating...
nsxt_policy_gateway_redistribution_config.test: Creation complete after 0s [id=565e9c43-2973-4918-b39a-4bd2fadb9f53]
nsxt_policy_gateway_redistribution_config.t0_route: Creation complete after 1s [id=124e56a3-202e-41b3-9d7e-3b30e8e84a17]
Releasing state lock. This may take a few moments...

Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
```

</details>

*Folder: `projects/EUDEV/test-t0-shr/100-T0`*
